---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.IncompatibleGeometry
enum: Autodesk.Revit.DB.Fabrication.FabricationPartFitResult
source: html/36a9c1b4-343e-c0ce-fd27-8b42b8a82288.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.IncompatibleGeometry

Failed because the part didn't have the dimensions required to meet the geometry requirements.